
//----------------- 文件 test1.pro ----------------------------------------- 
/****************************************************************************** 
 * Test1 程序是用于验证RISC_ CPU的功能, 是设计工作的重要环节 
 * 本程序测试RISC_ CPU的基本指令集，如果RISC_ CPU的各条指令执行正确， 
 * 它应在地址为2E(hex)处，在执行HLT时停止运行。 
 * 如果该程序在任何其他地址暂停运行，则必有一条指令运行出错。 
 * 可参照注释找到出错的指令。 
 *****************************************************************************/ 
 
//机器码   地址     汇编助记符  注释
 
//------------------------------- test1.pro开始 --------------------------------------------------------------------- 
 @00                                                                                          //address statement 
    111_00000         //  00           BEGIN:   JMP TST_JMP 
    0011_1100 
    000_00000         //  02                            HLT                      //JMP did not work at all 
    0000_0000 
    000_00000         //  04                            HLT                       //JMP did not load PC, it skipped 
    0000_0000 
    101_11000         //  06          JMP_OK:  LDA  DATA_1 
    0000_0000 
    001_00000         //  08                             SKZ 
    0000_0000 
    000_00000         //  0a                             HLT                         //SKZ or LDA did not work 
    0000_0000 
    101_11000         //  0c                             LDA  DATA_2 
    0000_0001 
    001_00000         //  0e                              SKZ 
    0000_0000 
    111_00000         //  10                              JMP  SKZ_OK 
    0001_0100 
    000_00000        //  12                                HLT                                //SKZ or LDA did not work 
    0000_0000 
    110_11000        //  14               SKZ_OK:  STO TEMP                       //store non-zero value in TEMP 
    0000_0010 
    101_11000      //  16                                  LDA  DATA_1 
    0000_0000 
     110_11000      //  18                                  STO  TEMP                    //store zero value in TEMP
    0000_0010 
    101_11000      //  1a                                  LDA TEMP 
    0000_0010 
    001_00000      //  1c                                  SKZ                               //check to see if STO worked 
    0000_0000 
    000_00000      //  1e                                  HLT                              //STO did not work 
    0000_0000 
    100_11000      //  20                                  XOR DATA_2 
    0000_0001 
    001_00000      //  22                                 SKZ                              //check to see if XOR worked 
    0000_0000 
    111_00000      //  24                                JMP XOR_OK 
    0010_1000 
    000_00000      //  26                                HLT                               //XOR did not work at all 
    0000_0000 
    100_11000      //  28             XOR_OK:  XOR DATA_2 
    0000_0001 
    001_00000      //  2a                                SKZ 
    0000_0000 
    000_00000      //  2c                                HLT                              //XOR did not switch all bits 
    0000_0000 
    000_00000      //  2e                 END:     HLT                             //CONGRATULATIONS - TEST1 PASSED! 
    0000_0000 
    111_00000      //  30                               JMP BEGIN                //run test again 
    0000_0000 
 
@3c  
    111_00000     //  3c            TST_JMP:  JMP JMP_OK 
    0000_0110 
    000_00000     //  3e                                HLT                           //JMP is broken 
//-----------------------------test1.pro的结束-------------------------------------------- 
 
/*****************************************************************************************
** 
下面文件中的数据在仿真时需要用系统任务$readmemb读入RAM，才能被上面的汇编程序test1.pro使用。 
*****************************************************************************************
****/ 
//------------------------------test1.dat开始------------------------------------------------ 
@00                                                                  //address  statement  at RAM 
    00000000      //  1800      DATA_1:             //constant 00(hex)
    11111111      //  1801      DATA_2:             //constant FF(hex) 
    10101010      //  1802      TEMP:                 //variable - starts with AA(hex) 
//------------------------------test1.dat的结束------------------------------------------- 
 

 
/****************************************************************************** 
  * Test 2程序是用于验证RISC_ CPU的功能, 是设计工作的重要环节 
 * 本程序测试RISC_ CPU的高级指令集，如果RISC_ CPU的各条指令执行正确， 
 * 它应在地址为20(hex)处，在执行HLT时停止运行。 
 * 如果该程序在任何其他地址暂停运行，则必有一条指令运行出错。 
 * 可参照注释找到出错的指令。 
 * 注意：必须 先在RISC_ CPU 上运行 test1程序成功后，才可运行本程序。 
 *****************************************************************************/